airpocket-soundman/IchiPing/firmware/projects/02_servo_test/frdmmcxn947_cm33_core0/pins/pin_mux.h
/*
 * Copyright 2022-2024 NXP / 2026 IchiPing project
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * Pin routing for 02_servo_test — LPI2C2 on PIO4_0/4_1 (Arduino D18/D19).
 */

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

#if defined(__cplusplus)
extern "C" {
#endif

void BOARD_InitBootPins(void);
void BOARD_InitPins(void);
void LPI2C2_InitPins(void);

#if defined(__cplusplus)
}
#endif

#endif /* _PIN_MUX_H_ */
